Revit 2027 API
SpecTypeId.Reference.Material Property
 Material, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Material { get; }
Public Shared ReadOnly Property Material As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Material {
	ForgeTypeId^ get ();
}
static member Material : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace